# HorizontalExtent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..HorizontalExtent Property
CameraInfo Class See Also
---
Distance between left and right planes on the target plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double HorizontalExtent { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HorizontalExtent As Double
	Get
```

Visual C++
---
```text
public:
property double HorizontalExtent {
	double get ();
}
```

# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace